app/controllers/api/v1/sports_controller.rb

SELECT "sports".* FROM "sports"
---
      def index
        return render json: Sport.all

SELECT  "sports".* FROM "sports"  WHERE "sports"."id" = $1 LIMIT 1  [["id", 7]]
---
      def show
        return render json: Sport.find(params[:id])

INSERT INTO "sports" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-05-02 13:01:49.956219"], ["name", "MLS"], ["updated_at", "2014-05-02 13:01:49.956219"]]
---
      def create
        if current_user.has_role?(:admin)
          @sport = Sport.new(sport_params)
          if @sport.save

SELECT  "sports".* FROM "sports"  WHERE "sports"."id" = $1 LIMIT 1  [["id", 21]]
UPDATE "sports" SET "name" = $1, "updated_at" = $2 WHERE "sports"."id" = 21  [["name", "test2"], ["updated_at", "2014-05-02 15:15:48.385459"]]
---
      def update
        if current_user.has_role?(:admin)
          @sport = Sport.find(params[:id])
          update_params = sport_params
          update_params[:users] = user_id_list_to_users_for_update(update_params)
          if @sport.update!(update_params)

SELECT  "sports".* FROM "sports"  WHERE "sports"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "sports" WHERE "sports"."id" = $1  [["id", 6]]
---
      def destroy
        if current_user.has_role?(:admin)
          @sport = Sport.find(params[:id])
          if @sport.destroy