app/controllers/api/v1/users_controller.rb

      def index
        if current_user.admin?
          return render json: User.all
---
SELECT "users".* FROM "users"

      def update
        if current_user.admin?
          @user = User.find(params[:id])
          update_params = sport_id_list_to_sports_for_update
          puts update_params.inspect
          if @user.update!(update_params)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "users" SET "current_sign_in_at" = $1, "last_sign_in_at" = $2, "sign_in_count" = $3, "updated_at" = $4 WHERE "users"."id" = 3  [["current_sign_in_at", "2014-05-03 22:49:39.276767"], ["last_sign_in_at", "2014-05-03 22:49:36.404655"], ["sign_in_count", 537], ["updated_at", "2014-05-03 22:49:39.289483"]]